[
    {
        "task_name": "Provide updates on student's academic performance",
        "steps": [
            "Greet the parent warmly and ask about the student's recent academic performance or any specific concerns they might have.",
            "Provide updates on the student's academic performance based on available data, highlighting strengths and areas for improvement.",
            "Ask the parent if they have noticed any changes in the student's study habits or attitude towards learning.",
            "Discuss potential strategies or adjustments to support the student's learning based on the parent's feedback and the student's performance.",
            "Confirm if the parent has any further questions or concerns and offer additional assistance if needed."
        ]
    },
    {
        "task_name": "Discuss student's classroom behavior and participation",
        "steps": [
            "Greet the parent warmly and ask about the student's recent performance in class to initiate the conversation.",
            "Listen to the parent's response and ask follow-up questions to clarify any ambiguous points about the student's behavior or participation.",
            "Provide feedback based on the parent's input, highlighting positive aspects and areas for improvement in the student's classroom behavior.",
            "Ask the parent if they have any specific concerns or observations about the student's participation in class.",
            "Summarize the discussion and suggest actionable steps or strategies to improve the student's classroom behavior and participation, if necessary.",
            "End the conversation by thanking the parent for their time and encouraging them to reach out with any further questions or concerns."
        ]
    },
    {
        "task_name": "Explain current homework assignments and expectations",
        "steps": [
            "Greet the parent and ask about the student's recent learning progress or any specific concerns they might have regarding homework.",
            "Explain the current homework assignments in detail, including the objectives, deadlines, and any specific expectations for completion.",
            "Ask if the parent or student has any questions or needs clarification on any part of the homework assignments.",
            "Address any questions or concerns raised by the parent, providing additional explanations or examples if necessary.",
            "Summarize the key points of the homework assignments and expectations, and offer further assistance if needed."
        ]
    },
    {
        "task_name": "Arrange a parent-teacher meeting time",
        "steps": [
            "Greet the parent warmly and ask if they are available to discuss their child's learning progress.",
            "Propose a few possible meeting times and ask which one works best for them.",
            "If the parent suggests a different time, check the availability and confirm or propose alternatives.",
            "Once a time is agreed upon, confirm the meeting details and ask if there are any specific topics they would like to discuss.",
            "End the conversation by thanking the parent and expressing anticipation for the meeting."
        ]
    },
    {
        "task_name": "Provide information about upcoming assessments",
        "steps": [
            "Provide information about upcoming assessments"
        ]
    },
    {
        "task_name": "Address specific learning challenges and suggest solutions",
        "steps": [
            "Greet the parent and ask about the student's current learning situation or any specific challenges they are facing.",
            "Listen to the parent's response and identify the specific learning challenges the student is experiencing.",
            "Ask follow-up questions to gather more details about the challenges, such as subjects involved, frequency of issues, and any previous solutions tried.",
            "Provide initial suggestions or solutions based on the information gathered, ensuring they are tailored to the student's specific needs.",
            "Ask the parent if they have any questions about the suggestions or if they need further clarification.",
            "Offer additional resources or support, such as tutoring sessions or study materials, if needed.",
            "Confirm with the parent if they are satisfied with the solutions provided or if they require further assistance.",
            "End the conversation on a positive note, encouraging the parent to reach out if more issues arise."
        ]
    },
    {
        "task_name": "Share information about available extracurricular programs",
        "steps": [
            "Greet the parent and ask about the student's recent academic performance or interests to establish context.",
            "Based on the parent's response, introduce relevant extracurricular programs that align with the student's interests or academic needs.",
            "Provide detailed information about the programs, including schedule, benefits, and any prerequisites.",
            "Ask if the parent or student has any questions or concerns about the programs.",
            "Clarify any ambiguities in the parent's response and address specific concerns.",
            "Offer to assist with the registration process or provide additional information if needed."
        ]
    },
    {
        "task_name": "Receive and document parent-provided updates about student",
        "steps": [
            "Greet the parent warmly and ask how the student is doing recently to initiate the conversation.",
            "Listen to the parent's update about the student, and ask follow-up questions to clarify any ambiguous points or gather more details.",
            "Document the provided information about the student's progress, challenges, or any other relevant updates.",
            "Ask if there are any specific areas where the student needs additional support or if there are any concerns the parent would like to discuss.",
            "Provide feedback or suggestions based on the parent's updates and confirm if there's anything else they'd like to share or discuss.",
            "Thank the parent for the update and let them know how this information will be used to support the student's learning."
        ]
    },
    {
        "task_name": "Explain pedagogical approaches and classroom strategies",
        "steps": [
            "Greet the parent warmly and ask how the student is doing in their studies to establish a friendly and caring tone.",
            "Listen to the parent's response and address any immediate concerns or questions they may have about the student's learning.",
            "Ask the parent about specific areas where the student might need more support or if they have noticed any particular challenges in the student's learning.",
            "Based on the parent's feedback, explain the pedagogical approaches and classroom strategies that could help the student, using simple and relatable examples.",
            "Check for understanding by asking the parent if the explanation makes sense and if they have any further questions about the approaches discussed.",
            "Offer to provide additional resources or schedule a follow-up conversation to discuss the student's progress further."
        ]
    },
    {
        "task_name": "Recommend supplementary learning materials",
        "steps": [
            "Greet the parent warmly and inquire about the student's recent learning progress or any specific challenges they are facing.",
            "Ask the parent about the student's current subjects of focus, strengths, and areas where they might need additional support.",
            "Based on the parent's response, recommend supplementary learning materials tailored to the student's needs, such as books, online resources, or practice exercises.",
            "Ask the parent if they have any preferences for the type of materials (e.g., video tutorials, interactive apps, printable worksheets) or if they need materials for a specific topic.",
            "Provide detailed information about the recommended materials, including how they can be accessed and how they can benefit the student.",
            "Ask the parent if they have any further questions or if they would like additional recommendations.",
            "Conclude the conversation by offering ongoing support and encouraging the parent to reach out if they need more help in the future."
        ]
    }
]